samples/expression_tree_dot/and_ab.dot
digraph expression {
  rankdir=TB;
  "node1" [label = "AND", fillcolor = "lightgreen", style = "filled", name = "node1"];
  "node2" [label = "a", fillcolor = "lightblue", style = "filled", name = "node2"];
  "node3" [label = "b", fillcolor = "lightblue", style = "filled", name = "node3"];
  "node1" -> "node2" [label = "L"];
  "node1" -> "node3" [label = "R"];
}
