samples/expression_tree_mermaid/and_ab.mmd
graph TB
  node1["AND"]
  style node1 fill:lightgreen
  node2["a"]
  style node2 fill:lightblue
  node3["b"]
  style node3 fill:lightblue
  node1 -- "L" --> node2
  node1 -- "R" --> node3
